#include <iostream>
using namespace::std;
int main(){
    int x;
    int inf = 1;
    while (inf == 1){
        cout << "1) Ввод массива структур" << endl <<
        "2) Сортировка массива структур" << endl <<
        "3) Поиск в массиве структур по заданному параметру" << endl <<
        "4) Изменение заданной структуры" << endl <<
        "5) Удаление структуры из массива" << endl <<
        "6) Вывод на экран массива структур" << endl <<
        "7) Выход." << endl << 
        "Введите x:";
        cin >> x;
        switch(x){
            case 1: 
        }
    }
    return 0;
}
